ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_i2s.h
#define I2S_INTR_SET_RX_NOT_EMPTY_Pos     (18UL)                /*!< I2S INTR_SET: RX_NOT_EMPTY (Bit 18)                       */
#define I2S_INTR_SET_RX_NOT_EMPTY_Msk     (0x40000UL)           /*!< I2S INTR_SET: RX_NOT_EMPTY (Bitfield-Mask: 0x01)          */
#define I2S_INTR_SET_RX_FULL_Pos          (19UL)                /*!< I2S INTR_SET: RX_FULL (Bit 19)                            */
#define I2S_INTR_SET_RX_FULL_Msk          (0x80000UL)           /*!< I2S INTR_SET: RX_FULL (Bitfield-Mask: 0x01)               */
#define I2S_INTR_SET_RX_OVERFLOW_Pos      (21UL)                /*!< I2S INTR_SET: RX_OVERFLOW (Bit 21)                        */
#define I2S_INTR_SET_RX_OVERFLOW_Msk      (0x200000UL)          /*!< I2S INTR_SET: RX_OVERFLOW (Bitfield-Mask: 0x01)           */
#define I2S_INTR_SET_RX_UNDERFLOW_Pos     (22UL)                /*!< I2S INTR_SET: RX_UNDERFLOW (Bit 22)                       */
#define I2S_INTR_SET_RX_UNDERFLOW_Msk     (0x400000UL)          /*!< I2S INTR_SET: RX_UNDERFLOW (Bitfield-Mask: 0x01)          */
#define I2S_INTR_SET_RX_WD_Pos            (24UL)                /*!< I2S INTR_SET: RX_WD (Bit 24)                              */
#define I2S_INTR_SET_RX_WD_Msk            (0x1000000UL)         /*!< I2S INTR_SET: RX_WD (Bitfield-Mask: 0x01)                 */
/* =====================================================  I2S.INTR_MASK  ===================================================== */
#define I2S_INTR_MASK_TX_TRIGGER_Pos      (0UL)                 /*!< I2S INTR_MASK: TX_TRIGGER (Bit 0)                         */
#define I2S_INTR_MASK_TX_TRIGGER_Msk      (0x1UL)               /*!< I2S INTR_MASK: TX_TRIGGER (Bitfield-Mask: 0x01)           */
#define I2S_INTR_MASK_TX_NOT_FULL_Pos     (1UL)                 /*!< I2S INTR_MASK: TX_NOT_FULL (Bit 1)                        */
#define I2S_INTR_MASK_TX_NOT_FULL_Msk     (0x2UL)               /*!< I2S INTR_MASK: TX_NOT_FULL (Bitfield-Mask: 0x01)          */
#define I2S_INTR_MASK_TX_EMPTY_Pos        (4UL)                 /*!< I2S INTR_MASK: TX_EMPTY (Bit 4)                           */
#define I2S_INTR_MASK_TX_EMPTY_Msk        (0x10UL)              /*!< I2S INTR_MASK: TX_EMPTY (Bitfield-Mask: 0x01)             */
#define I2S_INTR_MASK_TX_OVERFLOW_Pos     (5UL)                 /*!< I2S INTR_MASK: TX_OVERFLOW (Bit 5)                        */
#define I2S_INTR_MASK_TX_OVERFLOW_Msk     (0x20UL)              /*!< I2S INTR_MASK: TX_OVERFLOW (Bitfield-Mask: 0x01)          */
#define I2S_INTR_MASK_TX_UNDERFLOW_Pos    (6UL)                 /*!< I2S INTR_MASK: TX_UNDERFLOW (Bit 6)                       */
#define I2S_INTR_MASK_TX_UNDERFLOW_Msk    (0x40UL)              /*!< I2S INTR_MASK: TX_UNDERFLOW (Bitfield-Mask: 0x01)         */
#define I2S_INTR_MASK_TX_WD_Pos           (8UL)                 /*!< I2S INTR_MASK: TX_WD (Bit 8)                              */
#define I2S_INTR_MASK_TX_WD_Msk           (0x100UL)             /*!< I2S INTR_MASK: TX_WD (Bitfield-Mask: 0x01)                */
#define I2S_INTR_MASK_RX_TRIGGER_Pos      (16UL)                /*!< I2S INTR_MASK: RX_TRIGGER (Bit 16)                        */
#define I2S_INTR_MASK_RX_TRIGGER_Msk      (0x10000UL)           /*!< I2S INTR_MASK: RX_TRIGGER (Bitfield-Mask: 0x01)           */
#define I2S_INTR_MASK_RX_NOT_EMPTY_Pos    (18UL)                /*!< I2S INTR_MASK: RX_NOT_EMPTY (Bit 18)                      */
#define I2S_INTR_MASK_RX_NOT_EMPTY_Msk    (0x40000UL)           /*!< I2S INTR_MASK: RX_NOT_EMPTY (Bitfield-Mask: 0x01)         */
#define I2S_INTR_MASK_RX_FULL_Pos         (19UL)                /*!< I2S INTR_MASK: RX_FULL (Bit 19)                           */
#define I2S_INTR_MASK_RX_FULL_Msk         (0x80000UL)           /*!< I2S INTR_MASK: RX_FULL (Bitfield-Mask: 0x01)              */
#define I2S_INTR_MASK_RX_OVERFLOW_Pos     (21UL)                /*!< I2S INTR_MASK: RX_OVERFLOW (Bit 21)                       */
#define I2S_INTR_MASK_RX_OVERFLOW_Msk     (0x200000UL)          /*!< I2S INTR_MASK: RX_OVERFLOW (Bitfield-Mask: 0x01)          */
#define I2S_INTR_MASK_RX_UNDERFLOW_Pos    (22UL)                /*!< I2S INTR_MASK: RX_UNDERFLOW (Bit 22)                      */
#define I2S_INTR_MASK_RX_UNDERFLOW_Msk    (0x400000UL)          /*!< I2S INTR_MASK: RX_UNDERFLOW (Bitfield-Mask: 0x01)         */
#define I2S_INTR_MASK_RX_WD_Pos           (24UL)                /*!< I2S INTR_MASK: RX_WD (Bit 24)                             */
#define I2S_INTR_MASK_RX_WD_Msk           (0x1000000UL)         /*!< I2S INTR_MASK: RX_WD (Bitfield-Mask: 0x01)                */
/* ====================================================  I2S.INTR_MASKED  ==================================================== */
#define I2S_INTR_MASKED_TX_TRIGGER_Pos    (0UL)                 /*!< I2S INTR_MASKED: TX_TRIGGER (Bit 0)                       */
#define I2S_INTR_MASKED_TX_TRIGGER_Msk    (0x1UL)               /*!< I2S INTR_MASKED: TX_TRIGGER (Bitfield-Mask: 0x01)         */
#define I2S_INTR_MASKED_TX_NOT_FULL_Pos   (1UL)                 /*!< I2S INTR_MASKED: TX_NOT_FULL (Bit 1)                      */
#define I2S_INTR_MASKED_TX_NOT_FULL_Msk   (0x2UL)               /*!< I2S INTR_MASKED: TX_NOT_FULL (Bitfield-Mask: 0x01)        */
#define I2S_INTR_MASKED_TX_EMPTY_Pos      (4UL)                 /*!< I2S INTR_MASKED: TX_EMPTY (Bit 4)                         */
#define I2S_INTR_MASKED_TX_EMPTY_Msk      (0x10UL)              /*!< I2S INTR_MASKED: TX_EMPTY (Bitfield-Mask: 0x01)           */
#define I2S_INTR_MASKED_TX_OVERFLOW_Pos   (5UL)                 /*!< I2S INTR_MASKED: TX_OVERFLOW (Bit 5)                      */
#define I2S_INTR_MASKED_TX_OVERFLOW_Msk   (0x20UL)              /*!< I2S INTR_MASKED: TX_OVERFLOW (Bitfield-Mask: 0x01)        */
#define I2S_INTR_MASKED_TX_UNDERFLOW_Pos  (6UL)                 /*!< I2S INTR_MASKED: TX_UNDERFLOW (Bit 6)                     */
#define I2S_INTR_MASKED_TX_UNDERFLOW_Msk  (0x40UL)              /*!< I2S INTR_MASKED: TX_UNDERFLOW (Bitfield-Mask: 0x01)       */
#define I2S_INTR_MASKED_TX_WD_Pos         (8UL)                 /*!< I2S INTR_MASKED: TX_WD (Bit 8)                            */
#define I2S_INTR_MASKED_TX_WD_Msk         (0x100UL)             /*!< I2S INTR_MASKED: TX_WD (Bitfield-Mask: 0x01)              */
#define I2S_INTR_MASKED_RX_TRIGGER_Pos    (16UL)                /*!< I2S INTR_MASKED: RX_TRIGGER (Bit 16)                      */
#define I2S_INTR_MASKED_RX_TRIGGER_Msk    (0x10000UL)           /*!< I2S INTR_MASKED: RX_TRIGGER (Bitfield-Mask: 0x01)         */
#define I2S_INTR_MASKED_RX_NOT_EMPTY_Pos  (18UL)                /*!< I2S INTR_MASKED: RX_NOT_EMPTY (Bit 18)                    */
#define I2S_INTR_MASKED_RX_NOT_EMPTY_Msk  (0x40000UL)           /*!< I2S INTR_MASKED: RX_NOT_EMPTY (Bitfield-Mask: 0x01)       */
#define I2S_INTR_MASKED_RX_FULL_Pos       (19UL)                /*!< I2S INTR_MASKED: RX_FULL (Bit 19)                         */
#define I2S_INTR_MASKED_RX_FULL_Msk       (0x80000UL)           /*!< I2S INTR_MASKED: RX_FULL (Bitfield-Mask: 0x01)            */
#define I2S_INTR_MASKED_RX_OVERFLOW_Pos   (21UL)                /*!< I2S INTR_MASKED: RX_OVERFLOW (Bit 21)                     */
#define I2S_INTR_MASKED_RX_OVERFLOW_Msk   (0x200000UL)          /*!< I2S INTR_MASKED: RX_OVERFLOW (Bitfield-Mask: 0x01)        */
#define I2S_INTR_MASKED_RX_UNDERFLOW_Pos  (22UL)                /*!< I2S INTR_MASKED: RX_UNDERFLOW (Bit 22)                    */
#define I2S_INTR_MASKED_RX_UNDERFLOW_Msk  (0x400000UL)          /*!< I2S INTR_MASKED: RX_UNDERFLOW (Bitfield-Mask: 0x01)       */
#define I2S_INTR_MASKED_RX_WD_Pos         (24UL)                /*!< I2S INTR_MASKED: RX_WD (Bit 24)                           */
#define I2S_INTR_MASKED_RX_WD_Msk         (0x1000000UL)         /*!< I2S INTR_MASKED: RX_WD (Bitfield-Mask: 0x01)              */


#endif /* _CYIP_I2S_H_ */


/* [] END OF FILE */
